[Killed] BlockStatement
q8/tasks.js:1:33
-export const helloWorld = () => {
-    const str = 'Hello World';
-    console.log('Hello World');
-    return str;
-}
+export const helloWorld = () => {}
 export const switchItUp = (number) =>  ['Zero', 'One', 'Two', 'Three', 'Four', 'Five', 'Six', 'Seven', 'Eight', 'Nine'][number];
 
killedBy: Hello World should work fine
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello World"
Received: undefined

[Killed] ArrowFunction
q8/tasks.js:6:27
     console.log('Hello World');
     return str;
 }
-export const switchItUp = (number) =>  ['Zero', 'One', 'Two', 'Three', 'Four', 'Five', 'Six', 'Seven', 'Eight', 'Nine'][number];
+export const switchItUp = () => undefined;
 
 export const capitalize = (text) => {
killedBy: switchItUp should work fine
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Zero"
Received: undefined

[Killed] StringLiteral
q8/tasks.js:6:88
     console.log('Hello World');
     return str;
 }
-export const switchItUp = (number) =>  ['Zero', 'One', 'Two', 'Three', 'Four', 'Five', 'Six', 'Seven', 'Eight', 'Nine'][number];
+export const switchItUp = (number) =>  ['Zero', 'One', 'Two', 'Three', 'Four', 'Five', "", 'Seven', 'Eight', 'Nine'][number];
 
 export const capitalize = (text) => {
killedBy: switchItUp should work fine
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Six"
Received: ""

[Killed] BlockStatement
q8/tasks.js:8:37
 }
 export const switchItUp = (number) =>  ['Zero', 'One', 'Two', 'Three', 'Four', 'Five', 'Six', 'Seven', 'Eight', 'Nine'][number];
 
-export const capitalize = (text) => {
-    if (text === null) {
-      return undefined;
-    }
-    const firstChar = text[0].toUpperCase();
-    const restSubstring = text.slice(1);
-    return `${firstChar}${restSubstring}`;
-  };
+export const capitalize = (text) => {};
 
 export const square = (x) => x * x
killedBy: Capitalize should capitalize the string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello"
Received: undefined

[Killed] BlockStatement
q8/tasks.js:9:24
 export const switchItUp = (number) =>  ['Zero', 'One', 'Two', 'Three', 'Four', 'Five', 'Six', 'Seven', 'Eight', 'Nine'][number];
 
 export const capitalize = (text) => {
-    if (text === null) {
-      return undefined;
-    }
+    if (text === null) {}
     const firstChar = text[0].toUpperCase();
     const restSubstring = text.slice(1);
killedBy: Capitalize shouldnt capitalize the string
statusReason: TypeError: Cannot read properties of null (reading '0')

[Killed] ConditionalExpression
q8/tasks.js:9:9
 export const switchItUp = (number) =>  ['Zero', 'One', 'Two', 'Three', 'Four', 'Five', 'Six', 'Seven', 'Eight', 'Nine'][number];
 
 export const capitalize = (text) => {
-    if (text === null) {
+    if (false) {
       return undefined;
     }
killedBy: Capitalize shouldnt capitalize the string
statusReason: TypeError: Cannot read properties of null (reading '0')

[Killed] MethodExpression
q8/tasks.js:12:23
     if (text === null) {
       return undefined;
     }
-    const firstChar = text[0].toUpperCase();
+    const firstChar = text[0].toLowerCase();
     const restSubstring = text.slice(1);
     return `${firstChar}${restSubstring}`;
killedBy: Capitalize should capitalize the string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello"
Received: "hello"

[Killed] MethodExpression
q8/tasks.js:13:27
       return undefined;
     }
     const firstChar = text[0].toUpperCase();
-    const restSubstring = text.slice(1);
+    const restSubstring = text;
     return `${firstChar}${restSubstring}`;
   };
killedBy: Capitalize should capitalize the string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello"
Received: "Hhello"

[Killed] ArithmeticOperator
q8/tasks.js:17:30
     return `${firstChar}${restSubstring}`;
   };
 
-export const square = (x) => x * x
+export const square = (x) => x / x
 
 export const getChildren = (arr) => arr.filter((child) => child.age < 17 ).map((child) => child.name);
killedBy: Square should work fine
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 1

[Killed] ArrowFunction
q8/tasks.js:17:23
     return `${firstChar}${restSubstring}`;
   };
 
-export const square = (x) => x * x
+export const square = () => undefined
 
 export const getChildren = (arr) => arr.filter((child) => child.age < 17 ).map((child) => child.name);
killedBy: Square should work fine
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] ArrowFunction
q8/tasks.js:19:48
 
 export const square = (x) => x * x
 
-export const getChildren = (arr) => arr.filter((child) => child.age < 17 ).map((child) => child.name);
+export const getChildren = (arr) => arr.filter(() => undefined ).map((child) => child.name);
 
 
killedBy: getChildren should work fine
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "Alice",
- ]

[Killed] ConditionalExpression
q8/tasks.js:19:59
 
 export const square = (x) => x * x
 
-export const getChildren = (arr) => arr.filter((child) => child.age < 17 ).map((child) => child.name);
+export const getChildren = (arr) => arr.filter((child) => false ).map((child) => child.name);
 
 
killedBy: getChildren should work fine
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "Alice",
- ]
